# -----------------------------------------------------------
# Лабораторная работа №3
# Регулярные выражения
# Выполнил: Ерохин Егор Геннадьевич (465870)
# Группа: P3111
# -----------------------------------------------------------

import first
import second
import third
from art import *


if __name__ == '__main__':
    Art = text2art("Lab 3")
    print(Art)
    print("Лабораторная работа №3\nРегулярные выражения\nВыполнил: Ерохин Егор Геннадьевич (465870)\nГруппа: P3111")
    print()
    first.testing()
    print()
    second.testing()
    print()
    third.testing()


